int Row[] = {2,7,A5,5,13,A4,12,A2}; //行 点阵引脚：{9，14,8，12,1,7,2,5}
int Col[] = {6,11,10,3,A3,4,8,9};   //列 {13,3,4,10,6,11,15,16} 
 
unsigned char F[8][8] =       
{
  0,0,0,0,0,0,0,0,
  0,1,1,1,1,1,1,0,
  0,1,0,0,0,0,0,0,
  0,1,1,1,1,1,1,0,
  0,1,0,0,0,0,0,0,
  0,1,0,0,0,0,0,0,
  0,1,0,0,0,0,0,0,
  0,0,0,0,0,0,0,0
};
 
unsigned char U[8][8] =     
{
  0,0,0,0,0,0,0,0,
  0,1,0,0,0,0,1,0,
  0,1,0,0,0,0,1,0,
  0,1,0,0,0,0,1,0,
  0,1,0,0,0,0,1,0,
  0,0,1,0,0,1,0,0,
  0,0,0,1,1,0,0,0,
  0,0,0,0,0,0,0,0
};

unsigned char C[8][8] =      
{
  0,0,0,0,0,0,0,0,
  0,0,0,1,1,1,1,0,
  0,0,1,0,0,0,0,0,
  0,1,0,0,0,0,0,0,
  0,1,0,0,0,0,0,0,
  0,0,1,0,0,0,0,0,
  0,0,0,1,1,1,1,0,
  0,0,0,0,0,0,0,0
};

unsigned char K[8][8] =      
{
  0,0,0,0,0,0,0,0,
  0,0,1,0,0,1,0,0,
  0,0,1,0,1,0,0,0,
  0,0,1,1,0,0,0,0,
  0,0,1,1,0,0,0,0,
  0,0,1,0,1,0,0,0,
  0,0,1,0,0,1,0,0,
  0,0,0,0,0,0,0,0
};
 
void setup()
{
   //循环定义行列PIN 为输出模式
  for(int i = 0;i<8;i++)
  {
    pinMode(Row[i],OUTPUT);
    pinMode(Col[i],OUTPUT);
  }
}
 
void loop()
{
  for(int i = 0 ; i < 50 ; i++)        
  {
    Display(F);                  
  }
  for(int i = 0 ; i < 50 ; i++)         
  {   
    Display(U);                 
  }
    for(int i = 0 ; i < 50 ; i++)         
  {   
    Display(C);                 
  }
    for(int i = 0 ; i < 50 ; i++)         
  {   
    Display(K);                 
  }
}
 
void Display(unsigned char dat[8][8])   //显示函数
{
  for(int c = 0; c<8;c++)
  {
    digitalWrite(Col[c],LOW);//选通第c列
 
    //循环
    for(int r = 0;r<8;r++)
    {
      digitalWrite(Row[r],dat[r][c]);
    }
    delay(1);
    Clear();  //清空显示去除余晖
  }
}
 
void Clear()                          //清空显示
{
  for(int i = 0;i<8;i++)
  {
    digitalWrite(Row[i],LOW);
    digitalWrite(Col[i],HIGH);
  }
}
